[
  {
    "name": "Luke Skywalker",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fluke-skywalker-image.jpg?alt=media&token=91aaea3d-89c9-4e9e-a51c-f7f0e0daec5e",
    "description": "Luke Skywalker was a Force-sensitive Human male who helped defeat the Galactic Empire in the Galactic Civil War and helped found the New Republic, as well as the New Jedi Order.\n\nBorn in 19 BBY as the son of the fallen Jedi Knight Anakin Skywalker and the Queen and Senator of Naboo, Padmé Amidala, Luke was raised on Tatooine and hidden from Emperor Palpatine and his father, who had recently become Darth Vader, Dark Lord of the Sith. In 0 BBY, Skywalker's life changed forever. A chance purchase of two droids, R2-D2 and C-3PO, led to him to receive training in the ways of the Force from Jedi Master Obi-Wan Kenobi and to meet Han Solo, and Princess Leia Organa, who was, unbeknownst to him, his twin sister. Skywalker then destroyed the first Death Star and joined the Rebel Alliance.\n\nOver the next few years, he fought in many of the most important battles of the Galactic Civil War, helping to found Rogue Squadron and fighting Imperial forces across the galaxy. In 3 ABY, Skywalker received Jedi training from Yoda, and learned from Vader that the Sith Lord was his father. One year later, he fought in the Battle of Endor, and succeeded in turning his father back to the light. Thanks to Skywalker, Palpatine was killed, and the Empire was dealt a crippling blow. One year later, the New Republic was formed.\n\nThroughout the succeeding decades, Skywalker helped keep peace throughout the galaxy as the New Republic slowly defeated small remnants of the Empire. When Palpatine returned in the form of several clone bodies, Luke temporarily fell to the dark side and became the resurrected Emperor's apprentice. He was later redeemed with the help of his friends, and continued with his goal of reviving the Jedi Order. In 11 ABY, he founded the New Jedi Order, and began teaching Force-sensitives about the ways of the Force at the Jedi Praxeum, fulfilling his destiny as the first of the new Jedi. In the midst of this rebirth came numerous challenges for Skywalker and his apprentices, including the Black Fleet Crisis, the Almanian Uprising, and the lure of Waru, but Skywalker, aided by fellow Jedi and his friends, was able to overcome each trial. Meanwhile, after a long series of failed relationships, Luke married fellow Jedi and former Emperor's Hand Mara Jade in 19 ABY.\n\nSeveral years after the conclusion of the Galactic Civil War, Skywalker found himself, yet again, on the front lines. Skywalker served as the leader of the New Jedi Order, during the Yuuzhan Vong War, an invasion by the extra-galactic Yuuzhan Vong species. During the war, Skywalker's wife gave birth to a son, who they named Ben, in memory of his first mentor of the force: Ben Kenobi. Skywalker endured countless battles as the New Republic was first pushed back, including the fall of his home on Coruscant. However, the newly reformed government, labeling itself the Galactic Federation of Free Alliances, regrouped and helped push back the alien invaders. In the final stages of the war, Skywalker sought out the living world of Zonama Sekot, convincing the planet to join the Galactic Alliance in a final battle on Coruscant, in which Skywalker personally led the assault on Supreme Overlord Shimrra Jamaane's citadel and slew Jamaane. Combined with the fact that his nephew, Jacen Solo, would soon after kill Jamaane's puppet master, Onimi, the Yuuzhan Vong were defeated and the war was ended.\n\nAfter the Yuuzhan Vong War, Skywalker maintained a prominent role among the Jedi into the Dark Nest Crisis, which saw him call a Jedi convocation to deal with strife within the Order. Faced with disunity, Skywalker assumed the title of Grand Master and direct control over the reestablished Jedi Council. Despite the successful handling of the Dark Nest Crisis and the Swarm War, lasting peace was yet to be achieved, as the Second Galactic Civil War broke out a few years later. Skywalker was plunged into a dark time as his nephew, Jacen Solo, became a Sith apprentice under his old adversary Lumiya and slew his beloved Mara. His grief was further compounded by his son's treading near the dark side as well, but he continued to lead the Jedi, forming the Jedi Coalition to oppose the rule of the Alliance by his nephew, now a Sith Lord by the name of Darth Caedus. With Skywalker's aid, Caedus was killed by his twin sister Jaina, ending the war and restoring peace to the galaxy.\n\nIn the aftermath of the war, Natasi Daala ascended to the position of Chief of State and fostered a wide spread anti-Jedi sentiment resulting in tensions between the Jedi Order and her government. Daala ultimately had Skywalker arrested for dereliction of duty, and in exchange for his freedom, he was exiled and forbidden from involving himself in the affairs of the Jedi Order. Skywalker and his son embarked on an odyssey across the galaxy in order to discover the causes of Jacen Solo's fall to the dark side. During their journey, the Skywalkers encountered the Lost Tribe of Sith, as well as a malevolent dark side entity known as Abeloth. With the help of his son and the rest of the Jedi, Skywalker returned to his position as Grand Master. Skywalker and his allies then repelled the Sith threat, and with the help of an unlikely Sith ally, defeated Abeloth, preventing another disaster that could endanger the galaxy.\n\nEventually, Luke passed away, and became one with the Force."
  },
  {
    "name": "C-3PO",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fc-3po-image.png?alt=media&token=5ec20611-38b8-4636-9aca-0a923e39f6c8",
    "description": "C-3PO, sometimes spelled See-Threepio and often referred to as Threepio, was a bipedal, humanoid protocol droid designed to interact with organics, programmed primarily for etiquette and protocol. He was fluent in over six million forms of communication, and developed a fussy and worry-prone personality throughout his many decades of operation. After being destroyed and discarded on the planet Tatooine before 32 BBY, C-3PO was rebuilt; his salvaged nature gave him special qualities that distinguished him from similar droid models. Along with his counterpart, the astromech droid R2-D2, C-3PO constantly found himself directly involved in pivotal moments of galactic history, and aided in saving the galaxy on many occasions. C-3PO considered various droids and organics to be friends of his, and was very dedicated to them, as well as to any master that he served.\n\nOriginally activated on Affa in 112 BBY, C-3PO had served as a protocol droid to the emissary of the Manakron system. Nearly eighty years later, he was gutted and discarded on the streets of Mos Espa, a city on the Outer Rim world of Tatooine. After being rebuilt by the Human slave Anakin Skywalker, C-3PO served Skywalker and his mother Shmi for over ten years, performing household chores and helping Skywalker earn his freedom by winning a pod race. Skywalker left Tatooine but returned in 22 BBY when his mother passed away, and C-3PO was given to Skywalker, now a Jedi Padawan, by Shmi's stepson Owen Lars. C-3PO, Skywalker, R2-D2, and the Naboo Senator Padmé Amidala immediately became embroiled in the Clone Wars, a galaxy-wide conflict between the Galactic Republic and the Separatist Confederacy of Independent Systems. Skywalker married Amidala and gave C-3PO to her as a wedding gift, and C-3PO faithfully assisted her in her senatorial duties throughout the three-year conflict. The two often entered the front lines of the war, at times fighting alongside Skywalker and R2-D2.\n\nAt the end of the war, Skywalker became a Sith Lord, Amidala passed away, the Jedi Order was exterminated, and the Republic was reorganized into a Galactic Empire. C-3PO's memory was erased, however R2-D2's memory was not. C-3PO and R2-D2 were assigned to the corvette Tantive IV of Alderaan, where they served Alderaan's viceroy Bail Organa for nineteen years. They were, however, separated from Organa during that time period, and got caught up in a wide variety of misadventures, ruining the gangster Tig Fromm, helping restore the Tammuz-an monarchy, and aiding the merchant Mungo Baobab in reviving his family's fortune, among other exploits. After rejoining the crew of the Tantive IV and serving under Captain Raymus Antilles, they became embroiled in the Galactic Civil War, and in 0 BBY, Leia Organa of the Rebel Alliance entrusted them to bring a copy of the Death Star plans to the Jedi Master Obi-Wan Kenobi on Tatooine. After meeting Skywalker's son Luke and the smuggler Han Solo, the droids helped rescue princess Leia from the Empire's Death Star and became directly attached to the three Humans, helping them and their rebellion defeat the Empire and restore freedom to the galaxy.\n\nWhen the Rebellion became a New Republic, C-3PO continued to serve Luke and the now-married Han & Leia Solo, helping them defeat remnants of the Empire. Notably, C-3PO helped the Solos raise their three children, and aided Luke in recruiting trainees for his New Jedi Order. His translation abilities proved crucial during major incidents on Bakura, the starship Teljkon Vagabond, and in the Kathol sector, and in 17 ABY, he and R2-D2 teamed up with a young mechanic named Cole Fardreamer to foil a plan to bomb the galactic capital of Coruscant. When an extra-galactic race of religious zealots known as the Yuuzhan Vong invaded the galaxy in 25 ABY, C-3PO participated in the four-year conflict that eventually saw the invaders defeated. The destruction wrought by the invaders, and particularly their harsh treatment of droids, caused C-3PO to deeply question his views on deactivation, immortality, and memory erasure. Twelve years later, he began helping raise the latest addition to the Solo/Skywalker clan; the spritely youth Allana."
  },
  {
    "name": "R2-D2",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fr2-d2-image.png?alt=media&token=ddc155c2-02a5-4661-b952-8cedeaf44ac1",
    "description": "R2-D2, pronounced Artoo-Detoo and often referred to as R2(Artoo), was an R2 series astromech droid manufactured by Industrial Automaton with masculine programming. A smart, spunky droid serving a multitude of masters over its lifetime, R2 never had a full memory wipe (apart from a partial mind-wipe by Cad Bane during the buildup to the senate hostage crisis) nor has he received new programming, with these factors resulting in an adventurous and independent attitude. Oftentimes finding himself in pivotal moments in galactic history, his bravery and ingenuity saved the galaxy time and time again.\n\nBeginning his service in the employ of Queen Amidala of Naboo, the droid would wind up serving Jedi Knight Anakin Skywalker during the waning years of the Galactic Republic, often accompanied by the protocol droid C-3PO in many adventures throughout the Clone Wars. After his master's turn to the dark side of the Force, he would eventually serve Senator Bail Organa for a time in the Imperial Senate. Nineteen years following the death of the Galactic Republic, he would play a pivotal role in helping the Alliance to Restore the Republic destroy the Empire's dreaded Death Star, carrying technical readouts essential to its destruction. Serving Jedi Purge survivor Luke Skywalker, the son of his two former masters throughout the Galactic Civil War, he would participate in both the Battles of Hoth and Endor, and would witness the destruction of the Empire's dreaded Death Star II a mere four years after the first space station's destruction.\n\nIn the subsequent thirty years, Artoo would accompany Luke Skywalker until the destruction of his attempted resurrection of the Jedi Order. Following Luke's disappearance, Artoo set himself into a self-imposed low power mode as newer droid models started to out-compute the aging astromech. Despite this, his celebrated role in the Rebellion protected him from the usual recycling procedure of many old droids, allowing him a peaceful semi-retirement in the Resistance as he pored over several decades of uninterrupted data, causing him to 'dream' of many of his greatest adventures."
  },
  {
    "name": "Darth Vader",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fdarth-vader-image.jpg?alt=media&token=71f8172e-2323-4a78-9d0e-cb6da44d4070",
    "description": "Anakin Skywalker, a Force-sensitive human male, was a Jedi Knight of the Galactic Republic and the Chosen One of the Force. During the Clone Wars, his accomplishments as a battlefield commander earned him the Hero With No Fear moniker. After turning to the dark side of the Force, he became known as Darth Vader—Dark Lord of the Sith and apprentice to Emperor Darth Sidious. As a Sith Lord, Vader turned against his former comrades and hunted the surviving Jedi into near extinction. He became an enforcer of the Galactic Empire, who worked to crush the Alliance to Restore the Republic for opposing his Sith Master's will. Yet despite his actions as Darth Vader, a glimmer of the light side of the Force remained within the former Anakin Skywalker.\n\nSkywalker was born in the year 41 BBY before moving to the Outer Rim planet Tatooine during the Age of the Republic. Although he had a mother, the slave Shmi Skywalker, the truth about his parentage was that Anakin had no father—leading Jedi Master Qui-Gon Jinn to suspect that Skywalker's conception was the work of the midi-chlorians. Recognizing the boy's unprecedented connection to the Force, Jinn was determined to see Skywalker trained as a member of the Jedi Order, the task of which ultimately fell to his Padawan Obi-Wan Kenobi following Jinn's death in 32 BBY. Over the next decade, Skywalker rose to become one of the strongest Jedi in galactic history. While he was both caring and compassionate, his fear of loss was ultimately the catalyst for his downfall. In 19 BBY, with the Clone Wars nearing conclusion, Skywalker succumbed to the temptations of the dark side, believing the Sith had the power to save the life of Senator Padmé Amidala, his secret wife. Christened \"Darth Vader\" by his new Master Darth Sidious, the newly-minted Sith Lord assaulted the Coruscant Jedi Temple, killing fully-trained Jedi and novice younglings alike. After assassinating the leaders of the Confederacy of Independent Systems, Vader was confronted on Mustafar by his one-time friend and mentor, Kenobi, resulting in a lightsaber duel that left Vader burned and mutilated. As a consequence of his defeat, he was rebuilt as a cyborg and encased in a life-sustaining suit of armor, further distancing the persona of Vader from that of Anakin Skywalker. In addition, Amidala's death in childbirth broke the fallen Jedi Knight's heart, leaving him more machine than man mentally as well as physically.\n\nThroughout the Dark Times, the former Anakin Skywalker brought fear to the galaxy in his capacity as the Emperor's dark enforcer. However, in spite of his deep immersion in darkness, Vader never succeeded in fully killing the side of himself that was Skywalker. His confrontation with his son, the aspiring Jedi Knight Luke Skywalker, during the Galactic Civil War awoke the compassion within the Sith Lord, causing Vader to renounce his allegiance to the Sith in order to save Luke from the Emperor's wrath. By killing his Master, however, Vader sustained critical damage to his armor, making death inevitable. Resigned to his fate, his dying wish was to see his son with his own eyes for the first and final time. In the end, he died not as Darth Vader but as Anakin Skywalker, the Chosen One who brought balance to the Force by destroying the Sith. His destiny fulfilled, Skywalker's consciousness was able to endure beyond death due to his sacrifice and redemption, allowing him to live on in spirit alongside his deceased Jedi mentors, Obi-Wan Kenobi and Grand Master Yoda. Yet the legacy of Vader also survived through Kylo Ren, his grandson by Princess Leia Organa. As Vader's descendant, Ren believed it was his destiny to complete his grandfather's legacy: the annihilation of the Jedi Order."
  },
  {
    "name": "Leia Organa",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fleia-organa-image.png?alt=media&token=5f6726ff-599c-416d-89af-b8a92de37be0",
    "description": "Leia Organa, a Force-sensitive human female, was a princess of Alderaan, a member of the Imperial Senate, a leader of the Alliance to Restore the Republic, a member of the Galactic Senate, and general of the Resistance. Born alongside her twin brother, Luke Skywalker in the year 19 BBY as Leia Amidala Skywalker, she was the daughter of the Jedi Knight Anakin Skywalker and Senator Padmé Amidala of Naboo. As a result of her father's fall to the dark side of the Force, the Skywalker children were separated with Leia becoming the adopted daughter of Senator Bail Organa and his wife, Queen Breha Organa, who renamed her Princess Leia Organa. Raised with the values of her adoptive parents, Organa supported the principles of the Galactic Republic and opposed the rule of its successor, the Galactic Empire. Despite succeeding to her adoptive father's post in the Imperial Senate, Organa worked in secret to undermine the Empire's operations and was entrusted with the stolen plans to the Death Star, an Imperial superweapon capable of destroying entire planets. Although she was unable to prevent the annihilation of her adopted homeworld, the plans were ultimately delivered to the Rebel Alliance, resulting in the destruction of the Death Star during the Battle of Yavin in 0 BBY.\n\nOrgana became a leading figure in the Alliance, participating in key events such as the Battle of Hoth in 3 ABY and the decisive Battle of Endor in 4 ABY. She also killed the Hutt crime lord Jabba Desilijic Tiure, earning her the title of \"Huttslayer.\" With the deaths of Emperor Palpatine and his apprentice, Darth Vader, the biological father of Organa and her brother, the Empire was defeated at the Battle of Jakku and subsequently forced to capitulate to the New Republic in 5 ABY. Having achieved her lifelong goal to overthrow the Empire and restore freedom to the galaxy, Organa settled down in an effort to start a family with her husband, the smuggler-turned-Rebel, Han Solo. She gave birth to their son, Ben Solo, on the day that marked the end of the Galactic Civil War. However, like his mother, Ben was born inherently strong with the Force due to his biological connection to the Chosen One, Anakin Skywalker. Due to the similarities between Ben and his grandfather, Organa placed her son in the custody of Jedi Master Luke Skywalker in the hope that Ben would not turn to the dark side as Vader once did.\n\nAs a senator of the New Republic, Organa opposed the Senate's lack of response to the rise of the First Order, a successor of the Empire in all but name. Sidelined by a new generation of political leaders, Organa founded the Resistance to monitor the activities of the First Order. By then, Organa's son had turned to the dark side and destroyed Skywalker's efforts to fully restore the Jedi Order. Adopting the persona of Kylo Ren, the former Ben Solo became the apprentice of Supreme Leader Snoke, although his mother remained hopeful that the light side of the Force still existed within her son. It was at Organa's request that her estranged husband attempt to bring Ren home, resulting in Han Solo's death at the hands of their son. Ren's parricidal actions caused Organa to lose faith in her son, believing he was indeed beyond the hope of redemption. At the same time, the First Order had risen with the intent of conquering the known galaxy in the wake of the Republic's collapse, leaving the Resistance alone in its war against the Empire's successor. Following the near destruction of the Resistance at the Battle of Crait, Organa retreated from the First Order with a handful of survivors aboard her late husband's starship, the Millennium Falcon."
  },
  {
    "name": "Owen Lars",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Flars-owen-image.png?alt=media&token=813bdf73-6b17-416e-a81c-ba1c2b8af0d9",
    "description": "Owen Lars was a human male moisture farmer from the desert planet Tatooine. He was the son of Aika and Cliegg Lars, and he became the stepbrother of Jedi Knight Anakin Skywalker when Cliegg remarried to Anakin's mother Shmi Skywalker, a former slave. When Shmi was killed by Tusken Raiders and Cliegg passed away soon after, Lars was left responsible for his family's farm. Around that time, Lars married his girlfriend, Beru Whitesun, and they toiled to maintain the homestead.\n\nThree years later, Lars' stepbrother betrayed the Jedi Order and became the Sith Lord Darth Vader. At that time, Lars and his wife were given custody of Skywalker's son, Luke, by Skywalker's Jedi Master, Obi-Wan Kenobi. The Jedi told Lars that Skywalker had been killed, and the farmer grew to resent Kenobi, believing he was responsible for his stepbrother's death. Fearing that the younger Skywalker would share a similar fate, Lars forbade Kenobi from seeing the boy, and he kept his nephew busy with work on the farm.\n\nShortly after the start of the Galactic Civil War, Lars and Skywalker purchased the droid R2-D2, who, unbeknownst to them, possessed stolen plans for the Death Star, an Imperial superweapon capable of destroying planets. Seeking to retrieve the data, Imperial stormtroopers tracked the droid to Lars' homestead, where they interrogated and murdered him and his wife. When Skywalker found his family had been killed, he left Tatooine with Kenobi to train as a Jedi, joining the Alliance to Restore the Republic and destroying the Death Star in the Battle of Yavin."
  },
  {
    "name": "Beru Whitesun lars",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fberu-whitesun-lars-image.png?alt=media&token=b87e148c-b928-4a2e-93b7-8b64c5fd7522",
    "description": "Beru Whitesun Lars, the wife of Owen Lars, was a Tatooinian woman who raised Luke Skywalker after the fall of the Galactic Republic. Coming from a long line of moisture farmers, Beru Whitesun grew up near Mos Eisley on Tatooine. On a trip to Anchorhead, she met Owen Lars, the son of another moisture farmer, Cliegg Lars. Beru and Owen fell in love, and Beru later became part of the Lars family.\n\nShortly before the outbreak of the Clone Wars, Owen's stepmother, Shmi Skywalker Lars, was kidnapped by Tusken Raiders, an event that brought Shmi's son, Anakin Skywalker, and his soon-to-be-wife, Padmé Amidala, to the Lars homestead. Three years later, when the galactic conflict came to a close, Beru and Owen became the guardians of their new baby nephew, Luke Skywalker, after his father turned to the dark side of the Force and became Darth Vader.\n\nThe Larses raised Skywalker like a son. Beru would often defend Skywalker's interests against Owen, who was overprotective of him out of fear that he would follow in Anakin's footsteps. Though Owen refused numerous times to let Skywalker go when he wished to leave home to attend the Imperial Academy with his friend Biggs Darklighter, Beru convinced her husband to let Skywalker go after staying on for only one more season. After a year had passed, Beru tried to convince Owen that it was time to let Skywalker move on, but they never had time to reach an agreement. The two were killed by Imperial stormtroopers, by order of Darth Vader, who were searching for a droid carrying the stolen Death Star plans."
  },
  {
    "name": "R5-D4",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fr5-d4-image.png?alt=media&token=73eb8bbc-2d1f-4129-8a38-934313bf6de4",
    "description": "R5-D4, also called \"Red\" by Luke Skywalker, was a red and white-striped R5 astromech droid owned by a group of Jawas on Tatooine in the early days of the Galactic Civil War. Shortly before the Battle of Yavin, the Jawas attempted to sell him to Owen Lars, but the droid purposely malfunctioned his motivator, so that Lars could purchase R2-D2 in R5-D4's place. The droid survived an Imperial attack on the sandcrawler soon after, and went out to find the rebellion."
  },
  {
    "name": "Biggs Darklighter",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fbiggs-darklighter-image.png?alt=media&token=74e21f4f-c83a-474a-8cdf-ae2b3bac3a55",
    "description": "Biggs Darklighter was a human male pilot who fought for the Alliance to Restore the Republic during the early days of the Galactic Civil War. He grew up on the desert world of Tatooine, where he became a close boyhood friend of Luke Skywalker. The two became pilots and dreamed of leaving Tatooine. Darklighter left his homeworld for the Imperial Academy, but defected from the Galactic Empire after graduation in order to join the Rebel Alliance. He returned to Tatooine one final time to tell Skywalker of his plans.\n\nWith his home planet behind him, Darklighter relocated to the Rebel base on Yavin 4. He reunited with Skywalker, who had helped rescue Princess Leia Organa, a leader in the Alliance, from the Death Star with stolen plans for the planet-destroying space station. The Rebellion analyzed the plans and organized the Battle of Yavin, where Darklighter and Skywalker flew as members of Red Squadron in the assault on the station. Skywalker successfully destroyed the Death Star, but not before Darklighter was killed in combat by Darth Vader."
  },
  {
    "name": "Obi-Wan Kenobi",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/People%2FImages%2Fobi-wan-kenobi-image.jpg?alt=media&token=013af9b8-0d5e-48cf-9e69-a682afd6bc42",
    "description": "Obi-Wan Kenobi, later known as Ben Kenobi during his exile, was a Force-sensitive human male Jedi Master who served the Galactic Republic. He was a mentor and close friend to both Anakin Skywalker and his son, Luke, training them in the ways of the Force.\n\nBorn on the planet Stewjon, Kenobi became the Padawan learner of Jedi Master Qui-Gon Jinn. Kenobi then became the first Jedi in a millennium to defeat a Sith Lord when he defeated Darth Maul during the Battle of Naboo. During the battle, Jinn was mortally wounded by Maul, and perished in Kenobi's arms. At Jinn's behest, Kenobi took Anakin Skywalker to be his own Padawan, training him during the decade leading up to the Clone Wars.\n\nDuring the Clone Wars, Skywalker was made a Jedi Knight while Kenobi (as a result of his military successes in the Outer Rim) was granted the title of Master and named to the Jedi Council. The two Jedi fought alongside each other as generals several times. In the last days of the Clone Wars, Skywalker turned to the dark side, betraying the Jedi. Skywalker's new Sith Master, Supreme Chancellor Palpatine, executed Order 66 to destroy the Jedi Order, though Kenobi survived and reunited with another survivor, Grand Master Yoda. Kenobi confronted Skywalker, who had now taken the name Darth Vader, on Mustafar, and the two dueled. Kenobi emerged the victor, gravely wounding Vader and remorsefully leaving him for dead. However, as Palpatine established the Galactic Empire in place of the Galactic Republic, Vader was rehabilitated, though he was forced to rely on a cybernetic suit for life support. Kenobi went into exile on Tatooine, where he would watch over Vader's newborn son, Luke Skywalker, who he took to live with his aunt and uncle, Beru and Owen Lars.\n\nSeventeen years into his exile, he eventually confronted his old enemy Maul, who he again defeated in a brief duel. As the former Sith lay dying in Kenobi's arms, the two finally made peace, and Maul stated that Luke would avenge them both.\n\nIn 0 BBY, Kenobi received a message via R2-D2 from Leia Organa asking for help in the Rebel Alliance's fight against the Empire. The droid contained the plans to the Death Star, a battle station created by the Empire capable of destroying planets, and the plans needed to be taken to Bail Organa on Alderaan. After Luke Skywalker's aunt and uncle were killed by Imperial forces searching for the plans, Skywalker agreed to join Kenobi on this mission and be trained as a Jedi. The pair were taken to Alderaan by Han Solo, only for them to discover that the planet had been destroyed by the Death Star. Their ship, the Millennium Falcon, was captured by the Death Star's tractor beam, and Kenobi was confronted by Darth Vader. Vader and Kenobi dueled again, and Kenobi allowed Vader to kill him so that Luke and his companions could escape the Death Star.\n\nIn the following years, as Luke continued fighting for the Rebel Alliance, Kenobi continued to give him guidance as a Force spirit, including directing Luke to the planet Dagobah, where Luke received training from one of Obi-Wan's Masters, Yoda."
  }
]
