[
  {
    "name": "Executor",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fexecutor-image.png?alt=media&token=51bca9c3-e951-47a7-b1b7-d33bbe090a72",
    "description": "O Super Destróier Estelar Executor foi o cruzador pessoal de Darth Vader e o primeiro dessa linha na Marinha Imperial. A engenheira Lira Wessex o desenhou como segmento ao Destróier Estelar classe Vitória II. O Executor foi um destróier monumental de 19 mil metros de comprimento, comportando um armamento capaz de limpar a face de um planeta, e um complemento militar capaz de aniquilar qualquer instalação em terra. A construção do Executor começou em total sigilo no isolado Sistema Scarl, onde Vader e Galen Marek tramavam um plano para derrubar o Imperador, mas logo este plano falhou, e o Executor foi transferido para os Estaleiros Fondor para a fase final de construção, onde o mesmo foi alvo de uma sabotagem por um grupo de almirantes imperiais que queriam matar Vader. Após a sua conclusão, o Executor foi mandado para Yavin 4, onde a Aliança Rebelde se escondia, e onde Vader esperava esmagar a rebelião de uma vez por todas, mas o Executor não conseguiu parar a evacuação de Yavin, e Griff morreu na batalha. Três anos depois da Batalha de Yavin, o almirante Kendal Ozzel levou o Executor e o Esquadrão da Morte na caça pela Aliança Rebelde, inclusive o próprio Vader, em busca de seu filho. Em 3 DBY o Executor levou o Império à vitória na Batalha de Hoth, mas devido a uma tática de abordagem desastrada de Ozzel, Vader o executou, assim imediatamente passando à Firmus Piett ao cargo de almirante do Executor. Sob o comando do mesmo, o Executor perseguiu a Millenium Falcon de Hoth até Bespin na Cidade das Nuvens, na busca contínua de Vader por Luke Skywalker, e novamente o Executor falhou na captura de Luke. Por um certo período de tempo durante a busca por Luke, o Executor voltou a Coruscant, onde as tensões entre Vader e o Príncipe Xizor do Sol Negro vieram a tona causando uma batalha na orbita do Planeta, onde o Executor destruiu o inimigo. Em 4 DBY, o Executor foi destruído em uma colisão com a Estrela da Morte II, causada por uma colisão 'acidental' de um caça estelar A-Wing pilotado por Arvel Crynyd com a ponte de comando do Executor. O superdestróier então foi puxado pelo poço gravitacional da Estrela da Morte, sendo completamente desintegrado com o super-choque."
  },
  {
    "name": "Sentinel-class landing craft",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fsentinel-class-landing-craft-image.png?alt=media&token=1e0b3ceb-8ad3-4343-9d29-0cbad84e182e",
    "description": "The Sentinel-class landing craft, also known as the Sentinel-class shuttle, was a transport used primarily by the Galactic Empire to carry troops, small vehicles, and supplies."
  },
  {
    "name": "Death Star",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fdeath-star-image.png?alt=media&token=57aa8282-e456-40c9-b8e5-651788e29fb6",
    "description": "A Death Star was a moon-sized Imperial military battlestation armed with a planet-destroying superlaser. The Death Stars, whose concept had been explored even before the Clone Wars, were the first in a long series of superweapons developed to execute the Tarkin Doctrine. The Death Star was designed to allow Emperor Palpatine to more directly control the Galactic Empire through fear. In most instances, a Death Star was to be commanded by a Moff. One Death Star was completely built by the Empire, with a second and third one never reaching full completion, as well as a prototype being in existence. In addition, a scaled-down version, the Tarkin, and a Hutt knockoff, the Darksaber, would be created by the Empire and Durga the Hutt, respectively. Both Death Stars were destroyed by the Rebel Alliance shortly after they became operational. The first Death Star was destroyed by Luke Skywalker, with the help of Han Solo, and the second Death Star was destroyed by Wedge Antilles and Lando Calrissian. Prior to the second Death Star being built, the Galactic Empire tested out a planetary superlaser for protecting its installations on the planet of Dubrillion. At some point after the second's destruction, the Rebel Alliance also attacked and destroyed a third Death Star. Following their destruction, other planet-devastating superweapons followed, including the Galaxy Gun, the Darksaber, the Sun Crusher, and the World Devastators."
  },
  {
    "name": "Millennium Falcon",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fmillennium-falcon-image.jpg?alt=media&token=10b493c8-31a4-4392-b8a6-63874cb62cf3",
    "description": "The Millennium Falcon, originally known as YT-1300 492727ZED, was a modified YT-1300 light freighter with a storied history stretching back to the decades before the Clone Wars and the rise of the Galactic Empire. Manufactured by the Corellian Engineering Corporation in 60 BBY, the light freighter was first owned by Corell Industries Limited and underwent several name changes before being bought by the smugglers Kal and Dova Brigger in 48 BBY, and the ship eventually ended up as the property of the secretive Republic Group under the name Stellar Envoy by 29 BBY. The Envoy was destroyed in a collision with a bulk freighter above Nar Shaddaa, but it was rebuilt and served various owners under different names before Quip Fargil named it after the bat-falcon, and it eventually fell into the hands of Lando Calrissian after a game of sabacc—but Calrissian himself lost the ship in another game of sabacc to the smuggler Han Solo several years later. Solo and his Wookiee copilot, Chewbacca, became the ship's most famous and permanent owners, flying the Falcon during their smuggling careers and their subsequent work with the Alliance to Restore the Republic; a fateful trip to the planet Alderaan from Tatooine, ferrying Ben Kenobi and Luke Skywalker there saw Solo and the Falcon embroiled in the Alliance's affairs and participating in the historic Battle of Yavin—during which Solo and Chewbacca flew the Falcon to save Skywalker from Imperial TIE fighters and allowed him to fire the shot that destroyed the Death Star. Despite Solo's insistence that he did not work for the Alliance, his misadventures continued to draw him back to the Rebels and Princess Leia Organa, and the Falcon was present for many pivotal battles of the Galactic Civil War such as the Battle of Hoth and the Battle of Endor—where Lando Calrissian and his copilot Nien Nunb flew alongside Wedge Antilles into the second Death Star's superstructure and fired the shots that spelled the massive battle station's destruction."
  },
  {
    "name": "Y-wing",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fy-wing-image.png?alt=media&token=7210a8b0-fe98-42f5-b0b6-56996c7bbc30",
    "description": "The BTL Y-wing starfighter was a fighter-bomber built by Koensayr Manufacturing. First used during the Clone Wars, then throughout the Galactic Civil War, it was a mainstay of the Alliance Starfighter Corps. It was often used as an assault bomber to attack enemy capital ships directly in conjunction with the later B-wing starfighters."
  },
  {
    "name": "X-wing",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fx-wing-image.jpg?alt=media&token=3b8786b9-082b-442c-b3d7-63cd0aed0458",
    "description": "The X-wing was a prominent series of multiple starfighters produced by Incom with a characteristic 'X' shape of four wings, known as S-foils, extending out from the fuselage. These starfighters were found in the service of the Rebel Alliance, New Republic, and Galactic Alliance. The X-wing was originally developed for the Galactic Empire, but the entire Incom design team defected with the prototypes to the Rebel Alliance, ending the contract. However, at least one X-wing was stolen by a stormtrooper."
  },
  {
    "name": "TIE Advanced x1",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Ftie-advanced-x1-image.png?alt=media&token=7f8cac2a-6eea-49ff-8f89-c59871541d06",
    "description": "The TIE Advanced x1, also known as 'TIE/x1' or 'TIE Interceptor prototype', was an advanced prototype starfighter touted as a replacement for the standard TIE Fighter tested by Darth Vader and X1 at the battles of Yavin and Mustafar respectively. While it never made it into production, many of its best design features were later incorporated into the TIE/sa bomber and TIE/IN interceptor. Further development of the Advanced continued, eventually leading to the TIE Avenger and TIE Defender."
  },
  {
    "name": "Slave 1",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fslave-1-image.png?alt=media&token=805a3462-1a09-4c01-bf0b-8017e7080efb",
    "description": "Slave I was a modified Firespray-31-class patrol and attack craft used by the infamous bounty hunter Jango Fett before the Clone Wars and later his unaltered cloned 'son' Boba Fett just prior to the Fall of the Republic and during the reign of the Galactic Empire. The ship in its original form was produced by a subsidiary company of Kuat Drive Yards, based on the planet Kuat."
  },
  {
    "name": "Imperial shuttle",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fimperial-shuttle-image.png?alt=media&token=6432cfd3-2912-4bca-b07c-720ffd84bd64",
    "description": "An Imperial shuttle was a tri-winged type of shuttle used by the Sith Empire. During the Sacking of Coruscant in the Great Galactic War, they were used as a means of transporting personnel and equipment to and from the occupied planet of Coruscant. The Sith Emperor had a personal shuttle that was kept in Kaas City for his private use. There also existed a smaller variant of the shuttle, which was used far more frequently."
  },
  {
    "name": "EF76 Nebulon-B escort frigate",
    "image": "https://firebasestorage.googleapis.com/v0/b/swproject-c300c.appspot.com/o/Starships%2FImages%2Fef76-nebulon-b-escort-frigate-image.jpg?alt=media&token=f70bfb4b-7841-4953-a15c-63cd0a777ed7",
    "description": "The EF76 Nebulon-B escort frigate was a 300-meter-long warship that was built by Kuat Drive Yards for use by the Imperial Navy, to protect convoys from Rebel Alliance starfighter actions. It was, however, used more famously by the Rebellion."
  }
]
